src/bsl/InformationRegisters/гкс_НоменклатураПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НоменклатураПЛК</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативнаяДокументацияНаОтборПроб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗерна</Name>
					<Comment>ERP-1605</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Comment>ERP-1377</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкиПриемкаПЛКПоТочкамМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКДокументамСАРА</Name>
					<Comment>ERP-1605</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуютсяЭлектронныеТабло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДопустимогоОтклоненияБрутто</Name>
					<Comment>ERP-2051</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическоеФормированиеДокументов</Name>
					<Comment>ERP-2240</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияТаблоЭлектроннойОчереди</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативПогрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СтатусыЗаписейВОчередиПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СтатусыЗаписейВОчередиПриемкиПЛК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьВОчередь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыЗаписьВОчередь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ГрафикПриемкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ГрафикПриемкиПЛК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧасПоЭО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ГрафикОтгрузкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ГрафикОтгрузкиПЛК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧасПоЭО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</Name>
			<Comment>ERP-2673</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтборПоНоменклатуре</Name>
					<Comment>Табло используется для определенной номенклатуры.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезОтбора</Name>
					<Comment>Табло используется для всей принимаемой номенклатуры</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ВидыЭлектронныхТабло.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ВидыЭлектронныхТабло</Name>
			<Comment>ERP-1130</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВесы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеНаВыгрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданияПроб</Name>
					<Comment>ERP-1425</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрошедшиеРегистрацию</Name>
					<Comment>ERP-2056</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/CommonModules/гкс_ЭлектроннаяОчередь/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Электронная очередь: серверные процедуры и функции для работы с электронной очередью.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс 

// Интерфейсная функция для одноименной функции регистра сведений гкс_НоменклатураПЛК
//
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - тип регистрации для отбора
//                 
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки -  вид перевозки для отбора
// 
//  Период	- Структура - структура с датами начала и окончания периода
//
// Возвращаемое значение:
//   Массив   - массив номенклатуры
//
Функция РабочаяНоменклатураПериода(ТипРегистрации, ВидПеревозки, Период) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РегистрыСведений.гкс_НоменклатураПЛК.РабочаяНоменклатураПериода(ТипРегистрации, ВидПеревозки, Период);
	
КонецФункции

// Интерфейсная функция для одноименной функции регистра сведений гкс_НоменклатураПЛК
//
// Параметры:
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - тип регистрации для отбора
//                 
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки -  вид перевозки для отбора
//                 
//  ДатаУстановки	- Дата - дата получения среза последних
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений с колонкой "Номенклатура"
//
Функция РабочаяНоменклатураНаДату(ТипРегистрации, ВидПеревозки, ДатаУстановки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РегистрыСведений.гкс_НоменклатураПЛК.РабочаяНоменклатураНаДату(ТипРегистрации, ВидПеревозки, ДатаУстановки);
	
КонецФункции

// Расширяет условие отбора по условию проезда, чтобы старые записи без заполненных значений
//		условий проезда определялись как DAP
//
// Параметры:
//  УсловиеПроезда - СправочникСсылка.гкс_УсловияПроезда - текущее условие проезда 
//
// Возвращаемое значение:
//   Массив - массив условий проезда
//
Функция ОтборПоУсловиямПроезда(УсловиеПроезда) Экспорт
	
	УсловияПроезда = Новый Массив;
	УсловияПроезда.Добавить(УсловиеПроезда);
	Если УсловиеПроезда = Справочники.гкс_УсловияПроезда.DAP Тогда
		УсловияПроезда.Добавить(Справочники.гкс_УсловияПроезда.ПустаяСсылка());
	КонецЕсли;
	
	Возврат УсловияПроезда;
	
КонецФункции

// Интерфейсная функция для одноименной функции регистра сведений гкс_НастройкиПриемкаПЛКПоТочкамМаршрута
//
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - точка маршрута для которой получаем параметр
//
// Возвращаемое значение:
//   число - количество минут
//
Функция ВремяОжиданияТранспортногоСредства(ТочкаМаршрута) Экспорт
	
	Возврат РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.
		ВремяОжиданияТранспортногоСредства(ТочкаМаршрута);
		
КонецФункции

#Область РегламентныеЗадания

Процедура ОбновлениеСтатусовЭлектроннойОчередиПЛК() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ОбновлениеСтатусовЭлектроннойОчередиПЛК);
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.ОбновитьСтатусыЭлектроннойОчереди();
		
КонецПроцедуры 

// Обработчик регламентного задания гкс_ОбновлениеТаблоЭлектроннойОчереди
//
Процедура ОбновлениеТаблоЭлектроннойОчереди() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.гкс_ОбновлениеТаблоЭлектроннойОчереди);
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ВариантИспользования", 
		Перечисления.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.БезОтбора);
		
	ПараметрыОбработки.Вставить("ВидПеревозки", 	Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль);
	ПараметрыОбработки.Вставить("ВидТабло", 		Перечисления.гкс_ВидыЭлектронныхТабло.НеПрошедшиеРегистрацию);
	ПараметрыОбработки.Вставить("ТипРегистрации", 	Перечисления.гкс_ТипРегистрации.Приемка);
	ПараметрыОбработки.Вставить("ТочкаМаршрута", 	Константы.гкс_ТочкаМаршрутаБазы.Получить());
	ПараметрыОбработки.Вставить("Номенклатура", 	Неопределено);
	
	Отказ = Ложь;
	
   	гкс_ИнтеграцияСЭлектроннымТаблоСервер.ОбновитьТаблоДляЭлектроннойОчереди(ПараметрыОбработки, Отказ);

КонецПроцедуры

#КонецОбласти

Функция ПериодЭлектроннойОчередиЗаданКорректно(ПараметрыПериода) Экспорт
	
	НачалоПериода = НачалоЧаса(ПараметрыПериода.НачалоПериода);
	ОкончаниеПериода = КонецЧаса(ПараметрыПериода.ОкончаниеПериода);
	Номенклатура = ПараметрыПериода.Номенклатура;
	
	Если ПараметрыПериода.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		МенеджерГрафика = РегистрыСведений.гкс_ГрафикПриемкиПЛК;
	Иначе
		МенеджерГрафика = РегистрыСведений.гкс_ГрафикОтгрузкиПЛК;	
	КонецЕсли;
	
	КоличествоТранспорта = МенеджерГрафика.КоличествоТранспортныхСредствВЧас(ОкончаниеПериода, Номенклатура);
	
	Результат = Ложь;
	
	Если НЕ (ОкончаниеПериода > НачалоПериода И КоличествоТранспорта > 0) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Периоды = ШаблонОчередиЗаПериодСУчетомКоличестваТраснпорта(НачалоПериода, ОкончаниеПериода, КоличествоТранспорта);
	
	Для Каждого Период Из Периоды Цикл
		
		Если Период.НачалоПериода = ПараметрыПериода.НачалоПериода 
			И Период.ОкончаниеПериода = ПараметрыПериода.ОкончаниеПериода Тогда
			
			Результат = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Результат; 
	
КонецФункции

Функция ДатаЗаявкиАктуальна(Дата, ЧасовойПояс) Экспорт
	
	ДатаЧасовойПояс = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПояс);
	Возврат Дата >= ДатаЧасовойПояс;
	
КонецФункции

#Область СтатусыЭлектроннойОчереди

// Устанавливает статус записи в очереди
// Может записать в очередь, удалить запись из очереди
//
// Параметры:
//  Запись - ДокументСсылка.гкс_ЗаписьВОчередьПриемкиПЛК - Запись в очередь
//  НовыйСтатус  - ПеречислениеСсылка.гкс_СтатусыЭлектроннойОчереди - новый статус записи
//
Процедура УстановитьСтатусЗаписиВЭлектроннойОчереди(Запись, НовыйСтатус) Экспорт
	
	РегистрыСведений.гкс_СтатусыЗаписейВОчередиПриемкиПЛК.УстановитьСтатусЗаписи(Запись, НовыйСтатус);

КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШаблонОчередиЗаПериодСУчетомКоличестваТраснпорта(Знач НачалоПериода, 
                                                         Знач ОкончаниеПериода, 
                                                         МаксимальноеКоличествоТранспортаВЧас)
	
	Очередь = ИнициализироватьТаблицуПериодов();
	
	Если МаксимальноеКоличествоТранспортаВЧас <= 0 И ОкончаниеПериода <= НачалоПериода Тогда
		Возврат Очередь;
	КонецЕсли; 
		
	СекундВМинуте= гкс_ОбщегоНазначенияКлиентСервер.СекундВМинуте();
    ИнтервалМеждуЗаписями = СекундВМинуте * Цел( СекундВМинуте / МаксимальноеКоличествоТранспортаВЧас);

	НачалоЧаса = НачалоЧаса(НачалоПериода);
	Для НомерЧаса = 1 По 24 Цикл
		
		Если НачалоЧаса > ОкончаниеПериода Тогда
			Прервать;
		КонецЕсли;
		
		Для СчетчикМашина = 0 По МаксимальноеКоличествоТранспортаВЧас - 1 Цикл
			
			НачалоПериодаЗаписи = НачалоЧаса + СчетчикМашина * ИнтервалМеждуЗаписями;
			Если НачалоПериодаЗаписи > ОкончаниеПериода Тогда
				Прервать;
			КонецЕсли;
			
			НоваяЗапись = Очередь.Добавить();
			НоваяЗапись.НачалоПериода = НачалоПериодаЗаписи;
			НоваяЗапись.ОкончаниеПериода = НачалоПериодаЗаписи + ИнтервалМеждуЗаписями;

		КонецЦикла;
		
		НачалоЧаса = НачалоЧаса + гкс_ОбщегоНазначенияКлиентСервер.СекундВЧасе();

	КонецЦикла;

	Возврат Очередь;

КонецФункции

Функция ИнициализироватьТаблицуПериодов() 
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("НачалоПериода");
	ТаблицаПериодов.Колонки.Добавить("ОкончаниеПериода");
	
	Возврат ТаблицаПериодов;
	
КонецФункции

#КонецОбласти
